Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
#ifndef CONFIG_STM32L4_LTDC_DEFBACKLIGHT
#define CONFIG_STM32L4_LTDC_DEFBACKLIGHT 0xf0
#endif
#define STM32_LTDC_BACKLIGHT_OFF 0x00

/* Color/video formats */

/* Layer 1 format */

#if defined(CONFIG_STM32L4_LTDC_L1_L8)
#define STM32_LTDC_L1_BPP         8
#define STM32_LTDC_L1_COLOR_FMT   FB_FMT_RGB8
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_L8)
#define STM32_LTDC_L1CMAP
#elif defined(CONFIG_STM32L4_LTDC_L1_AL44)
#define STM32_LTDC_L1_BPP         8
#define STM32_LTDC_L1_COLOR_FMT   ???
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_AL44)
#elif defined(CONFIG_STM32L4_LTDC_L1_AL88)
#define STM32_LTDC_L1_BPP         16
#define STM32_LTDC_L1_COLOR_FMT   ???
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_AL88)
#elif defined(CONFIG_STM32L4_LTDC_L1_ARGB4444)
#define STM32_LTDC_L1_BPP         16
#define STM32_LTDC_L1_COLOR_FMT   ???
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB4444)
#elif defined(CONFIG_STM32L4_LTDC_L1_RGB565)
#define STM32_LTDC_L1_BPP         16
#define STM32_LTDC_L1_COLOR_FMT   FB_FMT_RGB16_565
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_RGB565)
#elif defined(CONFIG_STM32L4_LTDC_L1_ARGB1555)
#define STM32_LTDC_L1_BPP         16
#define STM32_LTDC_L1_COLOR_FMT   ???
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB1555)
#elif defined(CONFIG_STM32L4_LTDC_L1_RGB888)
#define STM32_LTDC_L1_BPP         24
#define STM32_LTDC_L1_COLOR_FMT   FB_FMT_RGB24
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_RGB888)
#elif defined(CONFIG_STM32L4_LTDC_L1_ARGB8888)
#define STM32_LTDC_L1_BPP         32
#define STM32_LTDC_L1_COLOR_FMT   ???
#define STM32_LTDC_L1PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB8888)
#endif

/* Layer 2 format */

#if defined(CONFIG_STM32L4_LTDC_L2_L8)
#define STM32_LTDC_L2_BPP         8
#define STM32_LTDC_L2_COLOR_FMT   FB_FMT_RGB8
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_L8)
#define STM32_LTDC_L2CMAP
#elif defined(CONFIG_STM32L4_LTDC_L2_AL44)
#define STM32_LTDC_L2_BPP         8
#define STM32_LTDC_L2_COLOR_FMT   ???
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_AL44)
#elif defined(CONFIG_STM32L4_LTDC_L2_AL88)
#define STM32_LTDC_L2_BPP         16
#define STM32_LTDC_L2_COLOR_FMT   ???
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_AL88)
#elif defined(CONFIG_STM32L4_LTDC_L2_ARGB4444)
#define STM32_LTDC_L2_BPP         16
#define STM32_LTDC_L2_COLOR_FMT   ???
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB4444)
#elif defined(CONFIG_STM32L4_LTDC_L2_RGB565)
#define STM32_LTDC_L2_BPP         16
#define STM32_LTDC_L2_COLOR_FMT   FB_FMT_RGB16_565
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_RGB565)
#elif defined(CONFIG_STM32L4_LTDC_L2_ARGB1555)
#define STM32_LTDC_L2_BPP         16
#define STM32_LTDC_L2_COLOR_FMT   ???
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB1555)
#elif defined(CONFIG_STM32L4_LTDC_L2_RGB888)
#define STM32_LTDC_L2_BPP         24
#define STM32_LTDC_L2_COLOR_FMT   FB_FMT_RGB24
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_RGB888)
#elif defined(CONFIG_STM32L4_LTDC_L2_ARGB8888)
#define STM32_LTDC_L2_BPP         32
#define STM32_LTDC_L2_COLOR_FMT   ???
#define STM32_LTDC_L2PFCR_PF      LTDC_LxPFCR_PF(LTDC_PF_ARGB8888)
#endif

/* Framebuffer sizes in bytes */

#if STM32_LTDC_L1_BPP == 8
#define STM32_L1_STRIDE (STM32_LTDC_WIDTH)
#elif STM32_LTDC_L1_BPP == 16
#define STM32_L1_STRIDE ((STM32_LTDC_WIDTH * 16 + 7) / 8)
#elif STM32_LTDC_L1_BPP == 24
#define STM32_L1_STRIDE ((STM32_LTDC_WIDTH * 24 + 7) / 8)
#elif STM32_LTDC_L1_BPP == 32
#define STM32_L1_STRIDE ((STM32_LTDC_WIDTH * 32 + 7) / 8)
#else
#error Undefined or unrecognized base resolution
#endif

/* LTDC only supports 8 bit per pixel overal */

#define STM32_LTDC_Lx_BYPP(n)        ((n) / 8)

#define STM32_L1_FBSIZE (STM32_L1_STRIDE * STM32_LTDC_HEIGHT)

#ifdef CONFIG_STM32L4_LTDC_L2
#ifndef CONFIG_STM32L4_LTDC_L2_WIDTH
#define CONFIG_STM32L4_LTDC_L2_WIDTH STM32_LTDC_WIDTH
#endif

#if CONFIG_STM32L4_LTDC_L2_WIDTH > STM32_LTDC_WIDTH
#error Width of Layer 2 exceeds the width of the display
#endif

#ifndef CONFIG_STM32L4_LTDC_L2_HEIGHT
#define CONFIG_STM32L4_LTDC_L2_HEIGHT STM32_LTDC_HEIGHT
#endif

#if CONFIG_STM32L4_LTDC_L2_HEIGHT > STM32_LTDC_HEIGHT
#error Height of Layer 2 exceeds the height of the display
#endif

#if STM32_LTDC_L2_BPP == 8
#define STM32_L2_STRIDE (CONFIG_STM32L4_LTDC_L2_WIDTH)
#elif STM32_LTDC_L2_BPP == 16
#define STM32_L2_STRIDE ((CONFIG_STM32L4_LTDC_L2_WIDTH * 16 + 7) / 8)
#elif STM32_LTDC_L2_BPP == 24
#define STM32_L2_STRIDE ((CONFIG_STM32L4_LTDC_L2_WIDTH * 24 + 7) / 8)
#elif STM32_LTDC_L2_BPP == 32
#define STM32_L2_STRIDE ((CONFIG_STM32L4_LTDC_L2_WIDTH * 32 + 7) / 8)
#else
#error Undefined or unrecognized base resolution
#endif

#define STM32_L2_FBSIZE (STM32_L2_STRIDE * CONFIG_STM32L4_LTDC_L2_HEIGHT)

#else
#define STM32_L2_FBSIZE (0)
#endif

/* Total memory used for framebuffers */

#define STM32_TOTAL_FBSIZE (STM32_L1_FBSIZE + STM32_L2_FBSIZE)

/* Debug option */

#ifdef CONFIG_STM32L4_LTDC_REGDEBUG
#define regdbg       dbg
#define regvdbg      vdbg
#else
#define regdbg(x...)
#define regvdbg(x...)
#endif

/* Preallocated LTDC framebuffers */

/* Position the framebuffer memory in the center of the memory set aside.  We
 * will use any skirts before or after the framebuffer memory as a guard against
 * wild framebuffer writes.
 */

#define STM32_LTDC_BUFFER_SIZE  CONFIG_STM32L4_LTDC_FB_SIZE
#define STM32_LTDC_BUFFER_FREE  (STM32_LTDC_BUFFER_SIZE - STM32_TOTAL_FBSIZE)
#define STM32_LTDC_BUFFER_START (CONFIG_STM32L4_LTDC_FB_BASE + STM32_LTDC_BUFFER_FREE/2)

#if STM32_LTDC_BUFFER_FREE < 0
#error "STM32_LTDC_BUFFER_SIZE not large enough for frame buffers"
#endif

/* Layer frame buffer */

#define STM32_LTDC_BUFFER_L1     STM32_LTDC_BUFFER_START
#define STM32_LTDC_ENDBUF_L1     (STM32_LTDC_BUFFER_L1 + STM32_L1_FBSIZE)

#ifdef CONFIG_STM32L4_LTDC_L2
#define STM32_LTDC_BUFFER_L2   STM32_LTDC_ENDBUF_L1
#define STM32_LTDC_ENDBUF_L2   (STM32_LTDC_BUFFER_L2 + STM32_L2_FBSIZE)
#else
#define STM32_LTDC_ENDBUF_L2   STM32_LTDC_ENDBUF_L1
#endif

