Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
/* Layer helpers */

#ifdef CONFIG_STM32L4_LTDC_L2
#define LTDC_NLAYERS 2
#else
#define LTDC_NLAYERS 1
#endif

#define LAYER(i)     g_ltdc.layer[i]
#define LAYER_L1     g_ltdc.layer[LTDC_LAYER_L1]
#define LAYER_L2     g_ltdc.layer[LTDC_LAYER_L2]

/* Dithering */

#ifndef CONFIG_STM32L4_LTDC_DITHER_RED
#define STM32_LTDC_DITHER_RED      0
#else
#define STM32_LTDC_DITHER_RED      CONFIG_STM32L4_LTDC_DITHER_RED
#endif
#ifndef CONFIG_STM32L4_LTDC_DITHER_GREEN
#define STM32_LTDC_DITHER_GREEN    0
#else
#define STM32_LTDC_DITHER_GREEN    CONFIG_STM32L4_LTDC_DITHER_GREEN
#endif
#ifndef CONFIG_STM32L4_LTDC_DITHER_BLUE
#define STM32_LTDC_DITHER_BLUE     0
#else
#define STM32_LTDC_DITHER_BLUE     CONFIG_STM32L4_LTDC_DITHER_BLUE
#endif

/* Background color */

#ifndef CONFIG_STM32L4_LTDC_BACKCOLOR
#define STM32_LTDC_BACKCOLOR       0
#else
#define STM32_LTDC_BACKCOLOR       CONFIG_STM32L4_LTDC_BACKCOLOR
#endif

/* Internal operation flags */

#define LTDC_LAYER_SETAREA          (1 << 0)	/* Change visible area */
#define LTDC_LAYER_SETALPHAVALUE    (1 << 1)	/* Change constant alpha value */
#define LTDC_LAYER_SETBLENDMODE     (1 << 2)	/* Change blendmode */
#define LTDC_LAYER_SETCOLORKEY      (1 << 3)	/* Change color key */
#define LTDC_LAYER_ENABLECOLORKEY   (1 << 4)	/* Enable colorkey */
#define LTDC_LAYER_SETCOLOR         (1 << 5)	/* Change default color */
#define LTDC_LAYER_SETENABLE        (1 << 6)	/* Change enabled state */
#define LTDC_LAYER_ENABLE           (1 << 7)	/* Enable the layer */

/* Layer initializing state */

#define LTDC_LAYER_INIT             LTDC_LAYER_SETAREA | \
									LTDC_LAYER_SETALPHAVALUE | \
									LTDC_LAYER_SETBLENDMODE | \
									LTDC_LAYER_SETCOLORKEY | \
									LTDC_LAYER_SETCOLOR | \
									LTDC_LAYER_SETENABLE | \
									LTDC_LAYER_ENABLE

/* Blendfactor reset values for flip operation */

#define STM32_LTDC_BF1_RESET        6
#define STM32_LTDC_BF2_RESET        7

/*
 * Waits upon vertical sync
 * Note! Position is reserved in current SRCR register but not used
 */

#define LTDC_SRCR_WAIT              4

/* Calculate the size of the layers clut table */

#ifdef CONFIG_FB_CMAP
#define STM32_LTDC_CLUT_ENTRIES     256
#ifdef STM32_LTDC_L1CMAP
#define STM32_LAYER_CLUT_SIZE     1 * 3 * STM32_LTDC_CLUT_ENTRIES
#endif
#ifdef STM32_LTDC_L2CMAP
#undef  STM32_LAYER_CLUT_SIZE
#define STM32_LAYER_CLUT_SIZE     2 * 3 * STM32_LTDC_CLUT_ENTRIES
#endif
#endif

#ifndef CONFIG_FB_CMAP
#if defined(STM32_LTDC_L1CMAP) || defined(STM32_LTDC_L2CMAP)
#undef STM32_LTDC_L1CMAP
#undef STM32_LTDC_L2CMAP
#error "Enable cmap to support the configured layer format!"
#endif
#endif

/* Layer clut rgb value positioning */

#define LTDC_L1CLUT_REDOFFSET       0
#define LTDC_L1CLUT_GREENOFFSET     256
#define LTDC_L1CLUT_BLUEOFFSET      512
#define LTDC_L2CLUT_REDOFFSET       768
#define LTDC_L2CLUT_GREENOFFSET     1024
#define LTDC_L2CLUT_BLUEOFFSET      1280

/* Layer rgb clut register position */

#define LTDC_CLUT_ADD(n)            ((uint32_t)(n) << 24)
#define LTDC_CLUT_RED(n)            ((uint32_t)(n) << 16)
#define LTDC_CLUT_GREEN(n)          ((uint32_t)(n) << 8)
#define LTDC_CLUT_BLUE(n)           ((uint32_t)(n) << 0)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This enumeration names each layer supported by the hardware */

enum stm32_layer_e {
	LTDC_LAYER_L1 = 0,			/* LCD Layer 1 */
	LTDC_LAYER_L2,				/* LCD Layer 2 */
};

/* LTDC General layer information */

struct stm32_layer_s {
#ifdef CONFIG_STM32L4_LTDC_INTERFACE
	/* LTDC interface */

	struct ltdc_layer_s ltdc;	/* Layer control structure */
#endif

	struct stm32_ltdc_s state;	/* Layer state structure */

	/* Blending */

	uint8_t opac;				/* Opacity value for blending */
	uint8_t bf1;				/* Blend factor 1 */
	uint8_t bf2;				/* Blend factor 2 */

	/* Operation */

	uint8_t operation;			/* Operation flags */
};

/* This structure provides the state of each LTDC layer */

struct stm32_state_s {
	/* Layer state */

	struct stm32_ltdc_s state[LTDC_NLAYERS];
};

/* This structure provides the overall state of the LTDC layer */

struct stm32_ltdcdev_s {
	/* Layer information */

	struct stm32_layer_s layer[LTDC_NLAYERS];
};

/* Layer cmap table description */

#ifdef STM32_LAYER_CLUT_SIZE
enum stm32_clut_e {
	LTDC_L1CLUT_RED = LTDC_L1CLUT_REDOFFSET,
	LTDC_L1CLUT_GREEN = LTDC_L1CLUT_GREENOFFSET,
	LTDC_L1CLUT_BLUE = LTDC_L1CLUT_BLUEOFFSET,
	LTDC_L2CLUT_RED = LTDC_L2CLUT_REDOFFSET,
	LTDC_L2CLUT_GREEN = LTDC_L2CLUT_GREENOFFSET,
	LTDC_L2CLUT_BLUE = LTDC_L2CLUT_BLUEOFFSET
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Global register operation */

static void stm32_lcd_enable(bool enable);
static void stm32_ltdc_gpioconfig(void);
static void stm32_ltdc_periphconfig(void);
static void stm32_ltdc_bgcolor(uint32_t rgb);
static void stm32_ltdc_dither(bool enable, uint8_t red, uint8_t green, uint8_t blue);
static void stm32_ltdc_interrupt(uint32_t mask, uint32_t value);
static void stm32_ltdc_reload(uint8_t value);

/* Layer and layer register operation */

static inline void stm32_ltdc_lsetopac(FAR struct stm32_layer_s *layer);
static inline void stm32_ltdc_lunsetopac(FAR struct stm32_layer_s *layer);
static inline uint8_t stm32_ltdc_lgetopac(FAR struct stm32_layer_s *layer);
static inline bool stm32_ltdc_lvalidate(FAR struct stm32_layer_s *layer);
#ifdef CONFIG_STM32L4_LTDC_INTERFACE
static int stm32_ltdc_lvalidatearea(FAR struct stm32_layer_s *layer, fb_coord_t xpos, fb_coord_t ypos, fb_coord_t xres, fb_coord_t yres, fb_coord_t srcxpos, fb_coord_t srcypos);
#endif
static void stm32_ltdc_lupdate(FAR struct stm32_layer_s *layer);

static void stm32_ltdc_lpixelformat(FAR struct stm32_layer_s *layer);
static inline void stm32_ltdc_lframebuffer(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_larea(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_lcolor(FAR struct stm32_layer_s *layer, uint32_t argb);
static void stm32_ltdc_lcolorkey(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_lalpha(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_lblendmode(FAR struct stm32_layer_s *layer, uint8_t bf1, uint8_t bf2);

