Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
#ifdef STM32_LAYER_CLUT_SIZE
static void stm32_ltdc_cmapcpy(FAR struct fb_cmap_s *dest, FAR const struct fb_cmap_s *src);
static void stm32_ltdc_lclut(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_lclutenable(FAR struct stm32_layer_s *layer, bool enable);
#endif
static void stm32_ltdc_linit(int lid);
static void stm32_ltdc_lenable(FAR struct stm32_layer_s *layer);
static void stm32_ltdc_lclear(FAR struct stm32_layer_s *layer, uint16_t color);

/* Generic frame buffer interface */

static int stm32_getvideoinfo(FAR struct fb_vtable_s *vtable, struct fb_videoinfo_s *vinfo);
static int stm32_getplaneinfo(FAR struct fb_vtable_s *vtable, int planeno, struct fb_planeinfo_s *pinfo);

/* The following is provided only if the video hardware supports RGB color
 * mapping
 */

#ifdef STM32_LAYER_CLUT_SIZE
static int stm32_getcmap(struct fb_vtable_s *vtable, struct fb_cmap_s *cmap);
static int stm32_putcmap(struct fb_vtable_s *vtable, const struct fb_cmap_s *cmap);
#endif

/* ltdc interface */

#ifdef STM32_LAYER_CLUT_SIZE
static int stm32_setclut(struct ltdc_layer_s *layer, const struct fb_cmap_s *cmap);
static int stm32_getclut(struct ltdc_layer_s *layer, struct fb_cmap_s *cmap);
#endif
static int stm32_lgetvideoinfo(struct ltdc_layer_s *layer, struct fb_videoinfo_s *vinfo);
static int stm32_lgetplaneinfo(struct ltdc_layer_s *layer, int planeno, struct fb_planeinfo_s *pinfo);

#ifdef CONFIG_STM32L4_LTDC_INTERFACE
static int stm32_getlid(FAR struct ltdc_layer_s *layer, int *lid, uint32_t flag);
static int stm32_setcolor(FAR struct ltdc_layer_s *layer, uint32_t argb);
static int stm32_getcolor(FAR struct ltdc_layer_s *layer, uint32_t *argb);
static int stm32_setcolorkey(FAR struct ltdc_layer_s *layer, uint32_t argb);
static int stm32_getcolorkey(FAR struct ltdc_layer_s *layer, uint32_t *argb);
static int stm32_setalpha(FAR struct ltdc_layer_s *layer, uint8_t alpha);
static int stm32_getalpha(FAR struct ltdc_layer_s *layer, uint8_t *alpha);
static int stm32_setblendmode(FAR struct ltdc_layer_s *layer, uint32_t mode);
static int stm32_getblendmode(FAR struct ltdc_layer_s *layer, uint32_t *mode);
static int stm32_setarea(FAR struct ltdc_layer_s *layer, FAR const struct ltdc_area_s *area, fb_coord_t srcxpos, fb_coord_t srcypos);
static int stm32_getarea(FAR struct ltdc_layer_s *layer, FAR struct ltdc_area_s *area, fb_coord_t *srcxpos, fb_coord_t *srcypos);
static int stm32_update(FAR struct ltdc_layer_s *layer, uint32_t mode);

#ifdef CONFIG_STM32L4_DMA2D
static int stm32_blit(FAR struct ltdc_layer_s *dest, FAR struct ltdc_layer_s *fore, fb_coord_t forexpos, fb_coord_t foreypos, FAR struct ltdc_layer_s *back, FAR const struct ltdc_area_s *backarea);
static int stm32_blend(FAR struct ltdc_layer_s *dest, FAR struct ltdc_layer_s *fore, fb_coord_t forexpos, fb_coord_t foreypos, FAR struct ltdc_layer_s *back, FAR const struct ltdc_area_s *backarea);
#endif
#endif							/* CONFIG_STM32L4_LTDC_INTERFACE */
int up_ltdc_isr(int irq, uint32_t *regs);
int up_ltdc_er_isr(int irq, uint32_t *regs);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* PIO pin configurations */

static const uint32_t g_ltdcpins[] = {
	GPIO_LTDC_R4, GPIO_LTDC_R5, GPIO_LTDC_R6, GPIO_LTDC_R7,
	GPIO_LTDC_G4, GPIO_LTDC_G5, GPIO_LTDC_G6, GPIO_LTDC_G7,
	GPIO_LTDC_B4, GPIO_LTDC_B5, GPIO_LTDC_B6, GPIO_LTDC_B7,
#if BOARD_LTDC_OUTPUT_BPP > 12
	GPIO_LTDC_R3, GPIO_LTDC_G2, GPIO_LTDC_G3, GPIO_LTDC_B3,
#if BOARD_LTDC_OUTPUT_BPP > 16
	GPIO_LTDC_R2, GPIO_LTDC_B2,
#if BOARD_LTDC_OUTPUT_BPP > 18
	GPIO_LTDC_R0, GPIO_LTDC_R1, GPIO_LTDC_G0, GPIO_LTDC_G1,
	GPIO_LTDC_B0, GPIO_LTDC_B1,
#endif
#endif
#endif
	GPIO_LTDC_VSYNC, GPIO_LTDC_HSYNC, GPIO_LTDC_DE, GPIO_LTDC_CLK
};

#define STM32_LTDC_NPINCONFIGS (sizeof(g_ltdcpins) / sizeof(uint32_t))

/* This structure provides the base layer interface */

static const struct fb_vtable_s g_vtable = {
	.getvideoinfo = stm32_getvideoinfo,
	.getplaneinfo = stm32_getplaneinfo
#ifdef STM32_LAYER_CLUT_SIZE
	, .getcmap = stm32_getcmap,
	.putcmap = stm32_putcmap
#endif
};

/* The LTDC semaphore that enforces mutually exclusive access */

static sem_t g_lock;

/* The layer active state */

static uint8_t g_lactive;

#ifdef STM32_LAYER_CLUT_SIZE
/* The layers clut table entries */

static uint8_t g_clut[STM32_LAYER_CLUT_SIZE];

/* The layer 1 cmap */

#ifdef STM32_LTDC_L1CMAP
static struct fb_cmap_s g_cmap_l1 = {
	.len = STM32_LTDC_CLUT_ENTRIES,
	.red = &g_clut[LTDC_L1CLUT_RED],
	.green = &g_clut[LTDC_L1CLUT_GREEN],
	.blue = &g_clut[LTDC_L1CLUT_BLUE]
};
#endif

/* The layer 2 cmap */

#ifdef STM32_LTDC_L2CMAP
static struct fb_cmap_s g_cmap_l2 = {
	.len = STM32_LTDC_CLUT_ENTRIES,
	.red = &g_clut[LTDC_L2CLUT_RED],
	.green = &g_clut[LTDC_L2CLUT_GREEN],
	.blue = &g_clut[LTDC_L2CLUT_BLUE]
};
#endif
#endif

/* The initialized state of the overall LTDC layers */

static struct stm32_ltdcdev_s g_ltdc = {
	.layer[LTDC_LAYER_L1] = {
		.state = {
			.lid = LTDC_LAYER_L1,
			.pinfo = {
				.fbmem = (uint8_t *)STM32_LTDC_BUFFER_L1,
				.fblen = STM32_L1_FBSIZE,
				.stride = STM32_L1_STRIDE,
				.bpp = STM32_LTDC_L1_BPP
			},
			.vinfo = {
				.fmt = STM32_LTDC_L1_COLOR_FMT,
				.xres = STM32_LTDC_WIDTH,
				.yres = STM32_LTDC_HEIGHT,
				.nplanes = 1
			}
#ifdef STM32_LTDC_L1CMAP
			, .cmap = &g_cmap_l1
#endif
		}
	}
#ifdef CONFIG_STM32L4_LTDC_L2
	, .layer[LTDC_LAYER_L2] = {
		.state = {
			.lid = LTDC_LAYER_L2,
			.pinfo = {
				.fbmem = (uint8_t *)STM32_LTDC_BUFFER_L2,
				.fblen = STM32_L2_FBSIZE,
				.stride = STM32_L2_STRIDE,
				.bpp = STM32_LTDC_L2_BPP
			},
			.vinfo = {
				.fmt = STM32_LTDC_L2_COLOR_FMT,
				.xres = STM32_LTDC_WIDTH,
				.yres = STM32_LTDC_HEIGHT,
				.nplanes = 1
			}
#ifdef STM32_LTDC_L2CMAP
			, .cmap = &g_cmap_l2
#endif
		}
	}
#endif
};

/* Pixel format lookup table */

static const uint32_t stm32_fmt_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1PFCR_PF
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2PFCR_PF
#endif
};

/* Register lookup tables */

/* LTDC_LxCR */

static const uintptr_t stm32_cr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CR
#endif
};

/* LTDC_LxWHPCR */

static const uintptr_t stm32_whpcr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1WHPCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2WHPCR
#endif
};

