Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
/* LTDC_LxWVPCR */

static const uintptr_t stm32_wvpcr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1WVPCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2WVPCR
#endif
};

/* LTDC_LxPFCR */

static const uintptr_t stm32_pfcr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1PFCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2PFCR
#endif
};

/* LTDC_LxDCCR */

static const uintptr_t stm32_dccr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1DCCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2DCCR
#endif
};

/* LTDC_LxCKCR */

static const uintptr_t stm32_ckcr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CKCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CKCR
#endif
};

/* LTDC_LxCACR */

static const uintptr_t stm32_cacr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CACR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CACR
#endif
};

/* LTDC_LxBFCR */

static const uintptr_t stm32_bfcr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1BFCR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2BFCR
#endif
};

/* LTDC_LxCFBAR */

static const uintptr_t stm32_cfbar_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CFBAR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CFBAR
#endif
};

/* LTDC_LxCFBLR */

static const uintptr_t stm32_cfblr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CFBLR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CFBLR
#endif
};

/* LTDC_LxCFBLNR */

static const uintptr_t stm32_cfblnr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CFBLNR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CFBLNR
#endif
};

/* LTDC_LxCLUTWR */

#ifdef STM32_LAYER_CLUT_SIZE
static const uintptr_t stm32_clutwr_layer_t[LTDC_NLAYERS] = {
	STM32_LTDC_L1CLUTWR
#ifdef CONFIG_STM32L4_LTDC_L2
	, STM32_LTDC_L2CLUTWR
#endif
};
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/
LTDC_HandleTypeDef hltdc;
LTDC_LayerCfgTypeDef hlayer;
/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Configure global register
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_ltdc_gpioconfig
 *
 * Description:
 *   Configure GPIO pins for use with the LTDC
 *
 ****************************************************************************/

static void stm32_ltdc_gpioconfig(void)
{
	int i;

	gvdbg("Configuring pins\n");

	/* Configure each pin */

	for (i = 0; i < STM32_LTDC_NPINCONFIGS; i++) {
		regvdbg("set gpio%d = %08x\n", i, g_ltdcpins[i]);
		stm32l4_configgpio(g_ltdcpins[i]);
	}
}

/****************************************************************************
 * Name: stm32_ltdc_periphconfig
 *
 * Description:
 *   Configures the synchronous timings
 *   Configures the synchronous signals and clock polarity
 *
 ****************************************************************************/

static void stm32_ltdc_periphconfig(void)
{
	uint32_t regval;

	/* Configure GPIO's */

	stm32_ltdc_gpioconfig();

	/* Configure APB2 LTDC clock external */

	regvdbg("configured RCC_APB2ENR=%08x\n", getreg32(STM32_RCC_APB2ENR));

	/* Configure the SAI PLL external to provide the LCD_CLK */

	regvdbg("configured RCC_PLLSAI=%08x\n", getreg32(STM32_RCC_PLLSAICFGR));

	/* Configure dedicated clock external */

	regvdbg("configured RCC_DCKCFGR=%08x\n", getreg32(STM32_RCC_DCKCFGR));

	/* Configure LTDC_SSCR */

	regval = (STM32_LTDC_SSCR_VSH | STM32_LTDC_SSCR_HSW);
	regvdbg("set LTDC_SSCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_SSCR);
	regvdbg("configured LTDC_SSCR=%08x\n", getreg32(STM32_LTDC_SSCR));

	/* Configure LTDC_BPCR */

	regval = (STM32_LTDC_BPCR_AVBP | STM32_LTDC_BPCR_AHBP);
	regvdbg("set LTDC_BPCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_BPCR);
	regvdbg("configured LTDC_BPCR=%08x\n", getreg32(STM32_LTDC_BPCR));

	/* Configure LTDC_AWCR */

	regval = (STM32_LTDC_AWCR_AAH | STM32_LTDC_AWCR_AAW);
	regvdbg("set LTDC_AWCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_AWCR);
	regvdbg("configured LTDC_AWCR=%08x\n", getreg32(STM32_LTDC_AWCR));

	/* Configure LTDC_TWCR */

	regval = (STM32_LTDC_TWCR_TOTALH | STM32_LTDC_TWCR_TOTALW);
	regvdbg("set LTDC_TWCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_TWCR);
	regvdbg("configured LTDC_TWCR=%08x\n", getreg32(STM32_LTDC_TWCR));

	/* Configure LTDC_GCR */

	regval = (STM32_LTDC_GCR_PCPOL | STM32_LTDC_GCR_DEPOL | STM32_LTDC_GCR_VSPOL | STM32_LTDC_GCR_HSPOL);
	regvdbg("set LTDC_GCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_GCR);
	regvdbg("configured LTDC_GCR=%08x\n", getreg32(STM32_LTDC_GCR));
}

/****************************************************************************
 * Name: stm32_ltdc_bgcolor
 *
 * Description:
 *   Configures background color of the LCD controller.
 *
 * Parameter:
 *   rgb - RGB888 background color
 *
 ****************************************************************************/

static void stm32_ltdc_bgcolor(uint32_t rgb)
{
	regvdbg("set LTDC_BCCR=%08x\n", rgb);
	putreg32(rgb, STM32_LTDC_BCCR);
	regvdbg("configured LTDC_BCCR=%08x\n", getreg32(STM32_LTDC_BCCR));
}

/****************************************************************************
 * Name: stm32_ltdc_dither
 *
 * Description:
 *   Configures dither settings of the LCD controller.
 *
 * Parameter:
 *   enable - Enable dithering
 *   red    - Red dither width
 *   green  - Green dither width
 *   blue   - Blue dither width
 *
 ****************************************************************************/

static void stm32_ltdc_dither(bool enable, uint8_t red, uint8_t green, uint8_t blue)
{
	uint32_t regval;

	regval = getreg32(STM32_LTDC_GCR);

	if (enable == true) {
		regval |= LTDC_GCR_DEN;
	} else {
		regval &= ~LTDC_GCR_DEN;
	}

	regval &= ~(!LTDC_GCR_DEN | LTDC_GCR_DRW(0) | LTDC_GCR_DGW(0) | LTDC_GCR_DBW(0));
	regval |= (LTDC_GCR_DRW(red) | LTDC_GCR_DGW(green) | LTDC_GCR_DBW(blue));

	regvdbg("set LTDC_GCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_GCR);
	regvdbg("configured LTDC_GCR=%08x\n", getreg32(STM32_LTDC_GCR));
}

/****************************************************************************
 * Name: stm32_ltdc_interrupt
 *
 * Description:
 *   Configures specific interrupt
 *
 * Parameter:
 *   mask  - Interrupt mask
 *   value - Interrupt value
 *
 ****************************************************************************/

static void stm32_ltdc_interrupt(uint32_t mask, uint32_t value)
{
	uint32_t regval;

