Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
	/* Get interrupts */

	regval = getreg32(STM32_LTDC_IER);
	regvdbg("get LTDC_IER=%08x\n", regval);
	regval &= ~mask;

	/* Set interrupt */

	regval |= value;
	regvdbg("set LTDC_IER=%08x\n", regval);
	putreg32(regval, STM32_LTDC_IER);
	regvdbg("configured LTDC_IER=%08x\n", getreg32(STM32_LTDC_IER));

	/* Configure LTDC_LIPCR */

	regvdbg("set LTDC_LIPCR=%08x\n", STM32_LTDC_LIPCR_LIPOS);
	putreg32(STM32_LTDC_LIPCR_LIPOS, STM32_LTDC_LIPCR);
	regvdbg("configured LTDC_LIPCR=%08x\n", getreg32(STM32_LTDC_LIPCR));
}

/****************************************************************************
 * Name: stm32_ltdc_reload
 *
 * Description:
 *   Reload the layer shadow register and make layer changes visible
 *
 * Parameter:
 *   value - Reload flag (e.g. upon vertical blank or immediately)
 *
 ****************************************************************************/

static void stm32_ltdc_reload(uint8_t value)
{
	/* Check if last reload is finished */

	while ((getreg32(STM32_LTDC_SRCR) & (LTDC_SRCR_VBR | LTDC_SRCR_IMR)) != 0) {
	}

	/* Reload shadow register */

	regvdbg("set LTDC_SRCR=%08x\n", value & ~LTDC_SRCR_WAIT);
	putreg32(value & ~LTDC_SRCR_WAIT, STM32_LTDC_SRCR);
	regvdbg("configured LTDC_SRCR=%08x\n", getreg32(STM32_LTDC_SRCR));

	/* Wait until registers reloaded */

	if (value & LTDC_SRCR_WAIT) {
		while ((getreg32(STM32_LTDC_SRCR) & (value & ~LTDC_SRCR_WAIT)) != 0) {
		}
	}
}

/****************************************************************************
 * Name: stm32_global_configure
 *
 * Description:
 *   Configure background color
 *   Configure interrupts
 *   Configure dithering
 *
 ****************************************************************************/

static void stm32_global_configure(void)
{
	/* Initialize the LTDC semaphore that enforces mutually exclusive access */

	sem_init(&g_lock, 0, 1);

	/* Set the default active layer */

#ifndef CONFIG_STM32L4_LTDC_L2
	g_lactive = LTDC_LAYER_L1;
#else
	g_lactive = LTDC_LAYER_L2;
#endif

#ifdef STM32_LAYER_CLUT_SIZE
	/* cleanup clut */

	memset(g_clut, 0, sizeof(g_clut));
#endif

	/* Configure dither */

	stm32_ltdc_dither(
#ifdef CONFIG_STM32L4_LTDC_DITHER
		true,
#else
		false,
#endif
		STM32_LTDC_DITHER_RED, STM32_LTDC_DITHER_GREEN, STM32_LTDC_DITHER_BLUE);

	/* Configure background color of the controller */

	stm32_ltdc_bgcolor(STM32_LTDC_BACKCOLOR);

	/* Enable line interrupt */

	stm32_ltdc_interrupt(STM32_LTDC_IER_LIE, 1);

	/* Disable fifo underrun interrupt */

	stm32_ltdc_interrupt(STM32_LTDC_IER_FUIE, 0);

	/* Disable transfer error interrupt */

	stm32_ltdc_interrupt(STM32_LTDC_IER_TERRIE, 0);

	/* Enable register reload interrupt */

	stm32_ltdc_interrupt(STM32_LTDC_IER_RRIE, 1);
}

/****************************************************************************
 * Name: stm32_lcd_enable
 *
 * Description:
 *   Disable the LCD peripheral
 *
 * Parameter:
 *   enable - Enable or disable
 *
 ****************************************************************************/

static void stm32_lcd_enable(bool enable)
{
	uint32_t regval;

	regval = getreg32(STM32_LTDC_GCR);
	regvdbg("get LTDC_GCR=%08x\n", regval);

	if (enable == true) {
		regval |= LTDC_GCR_LTDCEN;
	} else {
		regval &= ~LTDC_GCR_LTDCEN;
	}

	regvdbg("set LTDC_GCR=%08x\n", regval);
	putreg32(regval, STM32_LTDC_GCR);
	regvdbg("configured LTDC_GCR=%08x\n", getreg32(STM32_LTDC_GCR));
}

/****************************************************************************
 * Configure layer register
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_ltdc_lclutenable
 *
 * Description:
 *   Disable or enable the layer clut support
 *
 * Parameter:
 *   layer  - Reference to the layer control structure
 *   enable - Enable or disable
 *
 ****************************************************************************/

#ifdef STM32_LAYER_CLUT_SIZE
static void stm32_ltdc_lclutenable(FAR struct stm32_layer_s *layer, bool enable)
{
	uint32_t regval;

	regval = getreg32(stm32_cr_layer_t[layer->state.lid]);
	regvdbg("get LTDC_L%dCR=%08x\n", layer->state.lid + 1, regval);

	/* Disable the clut support during update the color table */

	if (enable == true) {
		regval |= LTDC_LxCR_CLUTEN;
	} else {
		regval &= ~LTDC_LxCR_CLUTEN;
	}

	regvdbg("set LTDC_L%dCR=%08x\n", layer->state.lid + 1, regval);
	putreg32(regval, stm32_cr_layer_t[layer->state.lid]);
}
#endif

/****************************************************************************
 * Name: stm32_ltdc_lsetopac
 *
 * Description:
 *   Helper to set the layer to opac
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static inline void stm32_ltdc_lsetopac(FAR struct stm32_layer_s *layer)
{
	layer->opac = 0xff;
}

/****************************************************************************
 * Name: stm32_ltdc_lunsetopac
 *
 * Description:
 *   Helper to set the layer opacity to the alpha value
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static inline void stm32_ltdc_lunsetopac(FAR struct stm32_layer_s *layer)
{
	layer->opac = 0;
}

/****************************************************************************
 * Name: stm32_ltdc_lgetopac
 *
 * Description:
 *   Helper to get the configured layer opacity
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static inline uint8_t stm32_ltdc_lgetopac(FAR struct stm32_layer_s *layer)
{
	return layer->opac | layer->state.alpha;
}

/****************************************************************************
 * Name: stm32_ltdc_lvalidate
 *
 * Description:
 *   Helper to check if the layer is an valid ltdc layer
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 * Return:
 *   true  - layer valid
 *   false - layer invalid
 *
 ****************************************************************************/

