Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
static inline bool stm32_ltdc_lvalidate(FAR struct stm32_layer_s *layer)
{
#ifdef CONFIG_STM32L4_LTDC_L2
	return layer == &LAYER_L1 || layer == &LAYER_L2;
#else
	return layer == &LAYER_L1;
#endif
}

/****************************************************************************
 * Name: stm32_ltdc_lvalidatearea
 *
 * Description:
 *   Check if layer coordinates out of valid area.
 *
 * Parameter:
 *   layer   - Reference to the layer control structure
 *   xpos    - top left x position of the active area
 *   ypos    - top left y position of the active area
 *   xres    - width of the active area
 *   yres    - height of teh active area
 *   srcxpos - Top left x position from where data visible in the active area
 *   srcypos - Top left y position from where data visible in the active area
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

#ifdef CONFIG_STM32L4_LTDC_INTERFACE
static int stm32_ltdc_lvalidatearea(FAR struct stm32_layer_s *layer, fb_coord_t xpos, fb_coord_t ypos, fb_coord_t xres, fb_coord_t yres, fb_coord_t srcxpos, fb_coord_t srcypos)
{
	FAR const struct fb_videoinfo_s *vinfo = &layer->state.vinfo;

	if ((xpos > vinfo->xres - 1) || (ypos > vinfo->yres - 1) || (xres > vinfo->xres - xpos) || (yres > vinfo->yres - ypos) || (srcxpos > xpos + xres - 1) || (srcypos > ypos + yres - 1)) {
		gdbg("layer coordinates out of valid area: xpos = %d > %d, ypos = %d > %d, width = %d > %d, height = %d > %d, srcxpos = %d > %d, srcypos = %d > %d", xpos, vinfo->xres - 1, ypos, vinfo->yres - 1, xres, vinfo->xres - xpos, yres, vinfo->yres - ypos, srcxpos, xpos + xres - 1, srcypos, ypos + yres - 1);

		gdbg("Returning EINVAL\n");
		return -EINVAL;
	}

	return OK;
}
#endif

/****************************************************************************
 * Name: stm32_ltdc_lupdate
 *
 * Description:
 *   Updates shadow register content depending on the layer operation flag.
 *   This made changes for the given layer visible after the next shadow
 *   register reload.
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lupdate(FAR struct stm32_layer_s *layer)
{
	if (layer->operation & LTDC_LAYER_SETAREA) {
		/* Updates the layer horizontal and vertical position register */

		stm32_ltdc_larea(layer);
	}

	if (layer->operation & LTDC_LAYER_SETALPHAVALUE) {
		/* Updates the constant alpha register */

		stm32_ltdc_lalpha(layer);
	}

	if (layer->operation & LTDC_LAYER_SETBLENDMODE) {
		/* Update blendfactor 1 and 2 register */

		stm32_ltdc_lblendmode(layer, layer->bf1, layer->bf2);
	}

	if (layer->operation & LTDC_LAYER_SETCOLORKEY) {
		/* Update layer colorkey register */

		stm32_ltdc_lcolorkey(layer);
	}

	if (layer->operation & LTDC_LAYER_SETCOLOR) {
		/* Update layer color register */

		stm32_ltdc_lcolor(layer, layer->state.color);
	}

	if (layer->operation & LTDC_LAYER_SETENABLE) {
		/* Enable the layer */

		stm32_ltdc_lenable(layer);
	}
}

/****************************************************************************
 * Name: stm32_ltdc_larea
 *
 * Description:
 *   Change the active area of the layer
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_larea(struct stm32_layer_s *layer)
{
	uint32_t lxpos;
	uint32_t lypos;
	uint32_t whpcr;
	uint32_t wvpcr;
	FAR struct stm32_ltdc_s *priv = &layer->state;
	FAR struct ltdc_area_s *area = &priv->area;

	regvdbg("xpos = %d, ypos = %d, xres = %d, yres = %d\n", area->xpos, area->ypos, area->xres, area->yres);

	lxpos = area->xpos + (STM32_LTDC_LxWHPCR_WHSTPOS + 1);
	lypos = area->ypos + (STM32_LTDC_LxWVPCR_WVSTPOS + 1);

	/* Accumulate horizontal position */

	whpcr = LTDC_LxWHPCR_WHSTPOS(lxpos);
	whpcr |= LTDC_LxWHPCR_WHSPPOS(lxpos + area->xres - 1);

	/* Accumulate vertical position */

	wvpcr = LTDC_LxWVPCR_WVSTPOS(lypos);
	wvpcr |= LTDC_LxWVPCR_WVSPPOS(lypos + area->yres - 1);

	/* Configure LxWHPCR / LxWVPCR register */

	regvdbg("set LTDC_L%dWHPCR=%08x\n", priv->lid + 1, whpcr);
	putreg32(whpcr, stm32_whpcr_layer_t[priv->lid]);
	regvdbg("set LTDC_L%dWVPCR=%08x\n", priv->lid + 1, wvpcr);
	putreg32(wvpcr, stm32_wvpcr_layer_t[priv->lid]);

	/* Configure framebuffer */

	stm32_ltdc_lframebuffer(layer);

	/* Clear area operation flag */

	layer->operation &= ~LTDC_LAYER_SETAREA;
}

/****************************************************************************
 * Name: stm32_ltdc_lpixelformat
 *
 * Description:
 *   Set the layer pixel format.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lpixelformat(FAR struct stm32_layer_s *layer)
{
	/* Configure PFCR register */

	regvdbg("set LTDC_L%dPFCR=%08x\n", layer->state.lid + 1, stm32_fmt_layer_t[layer->state.lid]);
	putreg32(stm32_fmt_layer_t[layer->state.lid], stm32_pfcr_layer_t[layer->state.lid]);
}

/****************************************************************************
 * Name: stm32_ltdc_framebuffer
 *
 * Description:
 *   Change layer framebuffer offset.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   Reference to the layer control structure
 *
 ****************************************************************************/

static inline void stm32_ltdc_lframebuffer(FAR struct stm32_layer_s *layer)
{
	uint32_t offset;
	uint32_t cfblr;
	FAR struct stm32_ltdc_s *priv = &layer->state;
	FAR struct ltdc_area_s *area = &priv->area;
	FAR const struct fb_planeinfo_s *pinfo = &priv->pinfo;

	/* Configure LxCFBAR register */

	/* Calculate offset position in the framebuffer */

	offset = priv->xpos * STM32_LTDC_Lx_BYPP(pinfo->bpp) + pinfo->stride * priv->ypos;

