Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
	regvdbg("set LTDC_L%dCFBAR=%08x\n", priv->lid + 1, pinfo->fbmem + offset);
	putreg32(pinfo->fbmem + offset, stm32_cfbar_layer_t[priv->lid]);

	/* Configure LxCFBLR register */

	/* Calculate line length */

	cfblr = LTDC_LxCFBLR_CFBP(pinfo->stride) | LTDC_LxCFBLR_CFBLL(area->xres * STM32_LTDC_Lx_BYPP(pinfo->bpp) + 3);

	regvdbg("set LTDC_L%dCFBLR=%08x\n", priv->lid + 1, cfblr);
	putreg32(cfblr, stm32_cfblr_layer_t[priv->lid]);

	/* Configure LxCFBLNR register */

	regvdbg("set LTDC_L%dCFBLNR=%08x\n", priv->lid + 1, area->yres);
	putreg32(area->yres, stm32_cfblnr_layer_t[priv->lid]);
}

/****************************************************************************
 * Name: stm32_ltdc_lalpha
 *
 * Description:
 *   Change the layer alpha value and clear the alpha operation flag.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lalpha(FAR struct stm32_layer_s *layer)
{
	uint8_t opac = stm32_ltdc_lgetopac(layer);
	regvdbg("set LTDC_L%dCACR=%02x\n", layer->state.lid + 1, opac);
	putreg32(opac, stm32_cacr_layer_t[layer->state.lid]);

	/* Clear the constant alpha operation flag */

	layer->operation &= ~LTDC_LAYER_SETALPHAVALUE;
}

/****************************************************************************
 * Name: stm32_ltdc_blendfactor
 *
 * Description:
 *   Change layer blend factors used for blend operation and clear the
 *   blendmode operation flag.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   layer - Reference to the laxer control structure
 *   bf1   - Value of blend factor 1
 *   bf2   - Value of blend factor 2
 *
 ****************************************************************************/

static void stm32_ltdc_lblendmode(FAR struct stm32_layer_s *layer, uint8_t bf1, uint8_t bf2)
{
	regvdbg("set LTDC_L%dBFCR=%08x\n", layer->state.lid + 1, (LTDC_LxBFCR_BF1(bf1) | LTDC_LxBFCR_BF2(bf2)));
	putreg32((LTDC_LxBFCR_BF1(bf1) | LTDC_LxBFCR_BF2(bf2)), stm32_bfcr_layer_t[layer->state.lid]);

	/* Clear the blendmode operation flag */

	layer->operation &= ~LTDC_LAYER_SETBLENDMODE;
}

/****************************************************************************
 * Name: stm32_ltdc_lcolor
 *
 * Description:
 *   Change layer default color and clear the color operation flag.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lcolor(FAR struct stm32_layer_s *layer, uint32_t argb)
{
	regvdbg("set LTDC_L%dDCCR=%08x\n", layer->state.lid + 1, argb);
	putreg32(argb, stm32_dccr_layer_t[layer->state.lid]);

	/* Clear the color operation flag */

	layer->operation &= ~LTDC_LAYER_SETCOLOR;
}

/****************************************************************************
 * Name: stm32_ltdc_lcolorkey
 *
 * Description:
 *   Change layer colorkey and clear the colorkey operation flag.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lcolorkey(FAR struct stm32_layer_s *layer)
{
	uint32_t regval;

	regval = getreg32(stm32_cr_layer_t[layer->state.lid]);

	if (layer->operation & LTDC_LAYER_ENABLECOLORKEY) {
		/* Set colorkey */

		regvdbg("set LTDC_L%dCKCR=%08x\n", layer->state.lid + 1, layer->state.colorkey);
		putreg32(layer->state.colorkey, stm32_ckcr_layer_t[layer->state.lid]);

		/* Enable colorkey */

		regval |= LTDC_LxCR_COLKEN;
	} else {
		/* Disable colorkey */

		regval &= ~LTDC_LxCR_COLKEN;
	}

	regvdbg("set LTDC_L%dCR=%08x\n", layer->state.lid + 1, regval);
	putreg32(regval, stm32_cr_layer_t[layer->state.lid]);

	/* Clear the colorkey operation flag */

	layer->operation &= ~LTDC_LAYER_SETCOLORKEY;
}

/****************************************************************************
 * Name: stm32_ltdc_lclut
 *
 * Description:
 *   Update the clut layer register during blank period.
 *   Note! The clut register are no shadow register.
 *
 * Parameter:
 *   layer  - Reference to the layer control structure
 *
 ****************************************************************************/

#ifdef STM32_LAYER_CLUT_SIZE
static void stm32_ltdc_lclut(FAR struct stm32_layer_s *layer)
{
	int n;
	uint32_t regval;
	FAR struct fb_cmap_s *cmap = layer->state.cmap;
	irqstate_t flags;

	/* Disable clut during register update */

	stm32_ltdc_lclutenable(layer, false);

	/* Reload shadow control register.
	 * This never changed any layer setting as long the layer register not up to
	 * date. This is what stm32_update does.
	 */

	stm32_ltdc_reload(LTDC_SRCR_IMR);

	flags = irqsave();

	/* Update the clut registers */

	for (n = cmap->first; n < cmap->len - cmap->first; n++) {
		regval = (uint32_t)LTDC_CLUT_ADD(n) | (uint32_t)LTDC_CLUT_RED(cmap->red[n]) | (uint32_t)LTDC_CLUT_GREEN(cmap->green[n]) | (uint32_t)LTDC_CLUT_BLUE(cmap->blue[n]);

		regvdbg("set LTDC_L%dCLUTWR = %08x, cmap->first = %d, cmap->len = %d\n", layer->state.lid + 1, regval, cmap->first, cmap->len);
		putreg32(regval, stm32_clutwr_layer_t[layer->state.lid]);
	}

	irqrestore(flags);

	/* Enable clut */

	stm32_ltdc_lclutenable(layer, true);

	/* Reload shadow control register */

	stm32_ltdc_reload(LTDC_SRCR_IMR);
}
#endif

/****************************************************************************
 * Name: stm32_ltdc_lenable
 *
 * Description:
 *   Disable or enable specific layer.
 *   Note! This changes have no effect until the shadow register reload has
 *   been done.
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_lenable(FAR struct stm32_layer_s *layer)
{
	uint32_t regval;

