Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
	/* Enable or disable layer */

	regval = getreg32(stm32_cr_layer_t[layer->state.lid]);

	if (layer->operation & LTDC_LAYER_ENABLE) {
		regval |= LTDC_LxCR_LEN;
	} else {
		regval &= ~LTDC_LxCR_LEN;
	}

	regvdbg("set LTDC_L%dCR=%08x\n", layer->state.lid + 1, regval);
	putreg32(regval, stm32_cr_layer_t[layer->state.lid]);

	/* Clear the enable operation flag */

	layer->operation &= ~LTDC_LAYER_SETENABLE;
}

/****************************************************************************
 * Name stm32_ltdc_lclear
 *
 * Description:
 *   Clear the whole layer
 *
 * Parameter:
 *   layer - Reference to the layer control structure
 *   color - The color to clear
 *
 * Return:
 *   OK      - On success
 *   -EINVAL - If one of the parameter invalid
 *
 ****************************************************************************/

static void stm32_ltdc_lclear(FAR struct stm32_layer_s *layer, uint16_t color)
{
	FAR struct stm32_ltdc_s *priv = &layer->state;

#if STM32_LTDC_L1_BPP == 8 || STM32_LTDC_L2_BPP == 8
	if (priv->pinfo.bpp == 8) {
		uint8_t *dest = (uint8_t *)priv->pinfo.fbmem;
		int i;

		gvdbg("Clearing display: BPP=%d color=%04x framebuffer=%08x size=%d\n", priv->pinfo.bpp, color, dest, priv->pinfo.fblen);

		for (i = 0; i < priv->pinfo.fblen; i += sizeof(uint8_t)) {
			*dest++ = (uint8_t)color;
		}

		return;
	}
#endif

#if STM32_LTDC_L1_BPP == 16 || STM32_LTDC_L2_BPP == 16
	if (priv->pinfo.bpp == 16) {
		uint16_t *dest = (uint16_t *)priv->pinfo.fbmem;
		int i;

		gvdbg("Clearing display: BPP=%d color=%04x framebuffer=%08x size=%d\n", priv->pinfo.bpp, color, dest, priv->pinfo.fblen);

		for (i = 0; i < priv->pinfo.fblen; i += sizeof(uint16_t)) {
			*dest++ = (uint16_t)color;
		}

		return;
	}
#endif

#if STM32_LTDC_L1_BPP == 24 || STM32_LTDC_L2_BPP == 24
	if (priv->pinfo.bpp == 24) {
		uint8_t *dest = (uint8_t *)priv->pinfo.fbmem;
		uint8_t r;
		uint8_t g;
		uint8_t b;
		int i;

		gvdbg("Clearing display: BPP=%d color=%04x framebuffer=%08x size=%d\n", priv->pinfo.bpp, color, dest, priv->pinfo.fblen);

		r = (uint8_t)color;
		g = (uint8_t)(color >> 8);
		b = (uint8_t)(color >> 16);

		for (i = 0; i < priv->pinfo.fblen; i += 3 * sizeof(uint8_t)) {
			*dest++ = r;
			*dest++ = g;
			*dest++ = b;
		}

		return;
	}
#endif

#if STM32_LTDC_L1_BPP == 32 || STM32_LTDC_L2_BPP == 32
	if (priv->pinfo.bpp == 32) {
		uint32_t *dest = (uint32_t *)priv->pinfo.fbmem;
		int i;

		gvdbg("Clearing display: BPP=%d color=%04x framebuffer=%08x size=%d\n", priv->pinfo.bpp, color, dest, priv->pinfo.fblen);

		for (i = 0; i < priv->pinfo.fblen; i += sizeof(uint32_t)) {
			*dest++ = (uint32_t)color;
		}
	}
#endif
}

/****************************************************************************
 * Name: stm32_ltdc_linit
 *
 * Description:
 *   Initialize layer to their default states.
 *
 *   Initialize:
 *   - Reset layer
 *   - layer fram
 *   - Reset layerebuffers
 *   - layer position
 *   - layer pixelformat
 *   - layer color
 *   - layer colorkey
 *   - layer alpha
 *   - layer blendmode
 *
 * Parameter
 *   layer - Reference to the layer control structure
 *
 ****************************************************************************/

static void stm32_ltdc_linit(int lid)
{
	/* Reset layer to their default state */

	FAR struct stm32_layer_s *layer = &LAYER(lid);
	FAR struct stm32_ltdc_s *state = &layer->state;
#ifdef CONFIG_STM32L4_LTDC_INTERFACE
	FAR struct ltdc_layer_s *ltdc = &layer->ltdc;

	/* Initialize the ltdc interface */

	ltdc->getlid = stm32_getlid;
	ltdc->getvideoinfo = stm32_lgetvideoinfo;
	ltdc->getplaneinfo = stm32_lgetplaneinfo;
#ifdef STM32_LAYER_CLUT_SIZE
	ltdc->setclut = stm32_setclut;
	ltdc->getclut = stm32_getclut;
#endif
	ltdc->setcolor = stm32_setcolor;
	ltdc->getcolor = stm32_getcolor;
	ltdc->setcolorkey = stm32_setcolorkey;
	ltdc->getcolorkey = stm32_getcolorkey;
	ltdc->setalpha = stm32_setalpha;
	ltdc->getalpha = stm32_getalpha;
	ltdc->setblendmode = stm32_setblendmode;
	ltdc->getblendmode = stm32_getblendmode;
	ltdc->setarea = stm32_setarea;
	ltdc->getarea = stm32_getarea;
	ltdc->update = stm32_update;
#ifdef CONFIG_STM32L4_DMA2D
	ltdc->blit = stm32_blit;
	ltdc->blend = stm32_blend;
#endif
#endif

	/* Initialize the layer state */

#ifdef STM32_LAYER_CLUT_SIZE
	state->cmap->first = 0;
#endif
	state->area.xpos = 0;
	state->area.ypos = 0;
	state->area.xres = STM32_LTDC_WIDTH;
	state->area.yres = STM32_LTDC_HEIGHT;
	state->xpos = 0;
	state->ypos = 0;
	state->color = 0;
	state->colorkey = 0;
	state->alpha = 0xff;
	state->blendmode = LTDC_BLEND_NONE;
	state->lock = &g_lock;

	/* Initialize driver internals */

	layer->opac = 0xff;
	layer->bf1 = LTDC_BF1_CONST_ALPHA;
	layer->bf2 = LTDC_BF2_CONST_ALPHA;
	layer->operation = LTDC_LAYER_INIT;

	/* Clear the layer framebuffer */

	stm32_ltdc_lclear(layer, 0);

	/* Set Pixel input format */

	stm32_ltdc_lpixelformat(layer);

	/* Set position, color, colorkey, blendmode, alpha */

	stm32_ltdc_lupdate(layer);

#ifdef STM32_LAYER_CLUT_SIZE
	/* Disable clut by default */

	if (layer->state.vinfo.fmt == FB_FMT_RGB8) {
		stm32_ltdc_lclutenable(layer, false);
	}
#endif
}

/****************************************************************************
 * Name: stm32_ltdc_cmapcpy
 *
 * Description:
 *   Copies a color table
 *   Note! Caller must check if first position is out of range
 *
 * Parameter:
 *   dest - color cmap to copy to
 *   src  - color map to copy from
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

#ifdef STM32_LAYER_CLUT_SIZE
static void stm32_ltdc_cmapcpy(FAR struct fb_cmap_s *dest, FAR const struct fb_cmap_s *src)
{
	int n;

	for (n = src->first; n < src->len && n < STM32_LTDC_CLUT_ENTRIES; n++) {
		regvdbg("n = %d, red = %02x, green = %02x, blue = %02x\n", n, src->red[n], src->green[n], src->blue[n]);
		dest->red[n] = src->red[n];
		dest->green[n] = src->green[n];
		dest->blue[n] = src->blue[n];
	}

	dest->first = src->first;
	dest->len = src->len;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_getvideoinfo
 *
 * Description:
 *   Get the videoinfo for the framebuffer
 *
 * Parameter:
 *   vtable - The framebuffer driver object
 *   vinfo  - the videoinfo object
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

