Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
static int stm32_getvideoinfo(struct fb_vtable_s *vtable, struct fb_videoinfo_s *vinfo)
{
	gvdbg("vtable=%p vinfo=%p\n", vtable, vinfo);
	if (vtable) {
		FAR struct ltdc_layer_s *ltdc;
#ifdef CONFIG_STM32L4_LTDC_L2
		ltdc = (FAR struct ltdc_layer_s *)&LAYER_L2;
#else
		ltdc = (FAR struct ltdc_layer_s *)&LAYER_L1;
#endif
		return stm32_lgetvideoinfo(ltdc, vinfo);
	}

	gdbg("ERROR: Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getplaneinfo
 *
 * Description:
 *   Get the planeinfo for the framebuffer
 *
 * Parameter:
 *   vtable - The framebuffer driver object
 *   pinfo  - the planeinfo object
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_getplaneinfo(struct fb_vtable_s *vtable, int planeno, struct fb_planeinfo_s *pinfo)
{
	gvdbg("vtable=%p planeno=%d pinfo=%p\n", vtable, planeno, pinfo);
	if (vtable) {
		FAR struct ltdc_layer_s *ltdc;
#ifdef CONFIG_STM32L4_LTDC_L2
		ltdc = (FAR struct ltdc_layer_s *)&LAYER_L2;
#else
		ltdc = (FAR struct ltdc_layer_s *)&LAYER_L1;
#endif
		return stm32_lgetplaneinfo(ltdc, planeno, pinfo);
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getcmap
 *
 * Description:
 *   Get a range of CLUT values for the LCD
 *
 * Parameter:
 *   vtable - The framebuffer driver object
 *   cmap   - the color table
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

#ifdef STM32_LAYER_CLUT_SIZE
static int stm32_getcmap(struct fb_vtable_s *vtable, struct fb_cmap_s *cmap)
{
#ifdef CONFIG_STM32L4_LTDC_L2
	return stm32_getclut((FAR struct ltdc_layer_s *)&LAYER_L2, cmap);
#else
	return stm32_getclut((FAR struct ltdc_layer_s *)&LAYER_L1, cmap);
#endif
}

/****************************************************************************
 * Name: stm32_putcmap
 *
 * Description:
 *   Set a range of the CLUT values for the LCD
 *
 * Parameter:
 *   vtable - The framebuffer driver object
 *   cmap   - the color table
 *
 * Return:
 * On success - OK
 * On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_putcmap(struct fb_vtable_s *vtable, const struct fb_cmap_s *cmap)
{
#ifdef CONFIG_STM32L4_LTDC_L2
	return stm32_setclut((FAR struct ltdc_layer_s *)&LAYER_L2, cmap);
#else
	return stm32_setclut((FAR struct ltdc_layer_s *)&LAYER_L1, cmap);
#endif
}
#endif							/* STM32_LAYER_CLUT_SIZE */

/****************************************************************************
 * Name: stm32_lgetvideoinfo
 *
 * Description:
 *   Get video information about the layer
 *
 * Parameter:
 *   layer  - Reference to the layer control structure
 *   vinfo  - Reference to the video info structure
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_lgetvideoinfo(struct ltdc_layer_s *layer, struct fb_videoinfo_s *vinfo)
{
	gvdbg("layer=%p vinfo=%p\n", layer, vinfo);
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;

	if (priv == &LAYER_L1 || priv == &LAYER_L2) {
		memcpy(vinfo, &priv->state.vinfo, sizeof(struct fb_videoinfo_s));

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_lgetplaneinfo
 *
 * Description:
 *   Get plane information about the layer
 *
 * Parameter:
 *   layer   - Reference to the layer control structure
 *   planeno - Number of the plane
 *   pinfo   - Reference to the plane info structure
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_lgetplaneinfo(struct ltdc_layer_s *layer, int planeno, struct fb_planeinfo_s *pinfo)
{
	gvdbg("layer=%p planeno=%d pinfo=%p\n", layer, planeno, pinfo);
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;

	if (stm32_ltdc_lvalidate(priv) && planeno == 0) {
		memcpy(pinfo, &priv->state.pinfo, sizeof(struct fb_planeinfo_s));
		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_setclut
 *
 * Description:
 *   Configure layer clut (color lookup table).
 *   Non clut is defined during initializing.
 *   Clut is active during next vertical blank period. Do not need an update.
 *
 * Parameter:
 *   layer  - Reference to the layer structure
 *   cmap   - color lookup table with up the 256 entries
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

#ifdef STM32_LAYER_CLUT_SIZE
static int stm32_setclut(struct ltdc_layer_s *layer, const struct fb_cmap_s *cmap)
{
	int ret;
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer=%p cmap=%p\n", layer, cmap);

	if (stm32_ltdc_lvalidate(priv) && cmap) {
		sem_wait(priv->state.lock);

		if (priv->state.vinfo.fmt != FB_FMT_RGB8) {
			gdbg("Error: CLUT is not supported for the pixel format: %d\n", priv->state.vinfo.fmt);
			ret = -EINVAL;
		} else if (cmap->first > STM32_LTDC_CLUT_ENTRIES) {
			gdbg("Error: CLUT offset is out of range: %d\n", cmap->first);
			ret = -EINVAL;
		} else {
			/* Copy to the layer cmap */

			stm32_ltdc_cmapcpy(priv->state.cmap, cmap);

			/* Update layer clut register */

			stm32_ltdc_lclut(priv);

			ret = OK;
		}

		sem_post(priv->state.lock);

		return ret;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getclut
 *
 * Description:
 *   Get configured layer clut (color lookup table).
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   cmap  - Reference to valid color lookup table accept up the 256 color
 *           entries
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

