Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
static int stm32_getclut(struct ltdc_layer_s *layer, struct fb_cmap_s *cmap)
{
	int ret;
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer=%p cmap=%p\n", layer, cmap);

	if (priv == &LAYER_L1 || priv == &LAYER_L2) {
		sem_wait(priv->state.lock);

		if (priv->state.vinfo.fmt != FB_FMT_RGB8) {
			gdbg("Error: CLUT is not supported for the pixel format: %d\n", priv->state.vinfo.fmt);
			ret = -EINVAL;
		} else if (cmap->len < priv->state.cmap->len) {
			gdbg("Error: cmap must accept %d color table entries: %d\n", priv->state.cmap->len);
			ret = -EINVAL;
		} else {
			/* Copy from the layer cmap */

			stm32_ltdc_cmapcpy(cmap, priv->state.cmap);

			ret = OK;
		}

		sem_post(priv->state.lock);

		return ret;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}
#endif							/* STM32_LAYER_CLUT_SIZE */

#ifdef CONFIG_STM32L4_LTDC_INTERFACE
/****************************************************************************
 * Name: getlid
 *
 * Description:
 *   Get a specific layer identifier.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   lid   - Reference to store the layer id
 *   flag  - Operation flag describe the layer identifier
 *           e.g. get the current active or inactive layer.
 *           See LTDC_LAYER_* for possible values
 *
 * Return:
 *   OK - On success
 *   Null if invalid flag
 *
 ****************************************************************************/

static int stm32_getlid(FAR struct ltdc_layer_s *layer, int *lid, uint32_t flag)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;

	gvdbg("flag = %08x\n", flag);

	if (stm32_ltdc_lvalidate(priv)) {
		int ret = OK;

		sem_wait(priv->state.lock);

		switch (flag) {
		case LTDC_LAYER_OWN:
			*lid = priv->state.lid;
			break;
#ifdef CONFIG_STM32L4_LTDC_L2
		case LTDC_LAYER_ACTIVE:
			*lid = g_lactive;
			break;
		case LTDC_LAYER_INACTIVE:
			*lid = !g_lactive;
			break;
		case LTDC_LAYER_TOP:
			*lid = LTDC_LAYER_L2;
			break;
		case LTDC_LAYER_BOTTOM:
			*lid = LTDC_LAYER_L1;
			break;
#else
		case LTDC_LAYER_ACTIVE:
		case LTDC_LAYER_INACTIVE:
		case LTDC_LAYER_TOP:
		case LTDC_LAYER_BOTTOM:
			*lid = LTDC_LAYER_L1;
			break;
#endif
		default:
			ret = EINVAL;
			gdbg("Returning EINVAL\n");
			break;
		}

		sem_post(priv->state.lock);

		return ret;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_setcolor
 *
 * Description:
 *    Configure layer default color value for the non active layer area.
 *    Default value during initializing: 0x00000000
 *    Color is active after next update.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   argb  - ARGB8888 color value
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 ****************************************************************************/

static int stm32_setcolor(FAR struct ltdc_layer_s *layer, uint32_t argb)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, argb = %08x\n", layer, argb);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		priv->state.color = argb;
		priv->operation |= LTDC_LAYER_SETCOLOR;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getcolor
 *
 * Description:
 *   Get configured layer color for the non active layer area.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   argb  - Reference to store the ARGB8888 color value
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
*******************************************************************************/

static int stm32_getcolor(FAR struct ltdc_layer_s *layer, uint32_t *argb)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, argb = %p\n", layer, argb);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		*argb = priv->state.color;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_setcolorkey
 *
 * Description:
 *    Configure layer default color key (chromakey) value for transparency.
 *    Layer default value during initializing: 0x00000000
 *    Colorkey is active after next update.
 *
 * Parameter:
 *   layer  - Reference to the layer structure
 *   rgb   - RGB888 color value
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_setcolorkey(FAR struct ltdc_layer_s *layer, uint32_t rgb)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, argb = %08x\n", layer, rgb);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		priv->state.colorkey = rgb;
		priv->operation |= LTDC_LAYER_SETCOLORKEY;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getcolorkey
 *
 * Description:
 *   Get the configured layer color key (chromakey) for transparency.
 *
 * Parameter:
 *   layer  - Reference to the layer structure
 *   rgb    - Reference to store the RGB888 color key
 *
 * Return:
 *   On success - OK
 *   On error   - -EINVAL
 *
 ****************************************************************************/

static int stm32_getcolorkey(FAR struct ltdc_layer_s *layer, uint32_t *rgb)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, argb = %p\n", layer, rgb);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		*rgb = priv->state.colorkey;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: setalpha
 *
 * Description:
 *   Configure layer alpha value factor into blend operation.
 *   During the layer blend operation the source alpha value is multiplied
 *   with this alpha value. If the source color format doesn't support alpha
 *   channel (e.g. non ARGB8888) this alpha value will be used as constant
 *   alpha value for blend operation.
 *   Default alpha value during initializing: 0xff
 *   Alpha is active after next update.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   alpha - Alpha value
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 ****************************************************************************/

static int stm32_setalpha(FAR struct ltdc_layer_s *layer, uint8_t alpha)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, alpha = %02x\n", layer, alpha);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		priv->state.alpha = alpha;
		priv->operation |= LTDC_LAYER_SETALPHAVALUE;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getalpha
 *
 * Description:
 *   Get configured layer alpha value factor for blend operation.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   alpha - Reference to store the alpha value
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 ****************************************************************************/

static int stm32_getalpha(FAR struct ltdc_layer_s *layer, uint8_t *alpha)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, alpha = %p\n", layer, alpha);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		*alpha = priv->state.alpha;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: setblendmode
 *
 * Description:
 *   Configure blend mode of the layer.
 *   Default mode during initialzing: LTDC_BLEND_NONE
 *   Blendmode is active after next update.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   mode  - Blend mode (see LTDC_BLEND_*)
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 * Procedure information:
 *   LTDC_BLEND_NONE:
 *     Informs the driver to disable all blend operation for the given layer.
 *     That means the layer is opaque. Note this has no effect on the
 *     colorkey settings.
 *
 *   LTDC_BLEND_ALPHA:
 *     Informs the driver to enable alpha blending for the given layer.
 *
 *   LTDC_BLEND_COLORKEY:
 *     Informs the driver to enable colorkeying for the given layer.
 *
 *   LTDC_BLEND_SRCPIXELALPHA:
 *     Informs the driver to use the pixel alpha value of the layer instead
 *     the constant alpha value. This is only useful for ARGB8888
 *     color format.
 *
 *   LTDC_BLEND_DESTPIXELALPHA:
 *     Informs the driver to use the pixel alpha value of the subjacent layer
 *     instead the constant alpha value. This is only useful for ARGB8888
 *     color format.
 *
 ****************************************************************************/

static int stm32_setblendmode(FAR struct ltdc_layer_s *layer, uint32_t mode)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, mode = %08x\n", layer, mode);

	if (stm32_ltdc_lvalidate(priv)) {
		int ret = OK;

		sem_wait(priv->state.lock);

		/* Disable alpha blending by default */

		priv->bf1 = LTDC_BF1_CONST_ALPHA;
		priv->bf2 = LTDC_BF2_CONST_ALPHA;
		stm32_ltdc_lsetopac(priv);

