Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
		/* Disable colorkeying by default */

		priv->operation &= ~LTDC_LAYER_ENABLECOLORKEY;

		if (mode & LTDC_BLEND_ALPHA) {
			/* Initialize blend factor */

			if (mode & LTDC_BLEND_SRCPIXELALPHA) {
				priv->bf1 = LTDC_BF1_PIXEL_ALPHA;
			} else if (mode & LTDC_BLEND_DESTPIXELALPHA) {
				priv->bf2 = LTDC_BF2_PIXEL_ALPHA;
			}

			/* Enable blending, restore the alpha value */

			stm32_ltdc_lunsetopac(priv);
			mode &= ~LTDC_BLEND_ALPHA;
		}

		if (mode & LTDC_BLEND_COLORKEY) {
			/* Enable colorkeying */

			priv->operation |= LTDC_LAYER_ENABLECOLORKEY;
			mode &= ~LTDC_BLEND_COLORKEY;
		}

		if (mode & ~(LTDC_BLEND_SRCPIXELALPHA | LTDC_BLEND_DESTPIXELALPHA)) {
			gdbg("Unknown blendmode %02x\n", mode);
			ret = -EINVAL;
		}

		if (ret == OK) {
			priv->state.blendmode = mode;
			priv->operation |= (LTDC_LAYER_SETBLENDMODE | LTDC_LAYER_SETALPHAVALUE | LTDC_LAYER_SETCOLORKEY);
		}

		sem_post(priv->state.lock);

		return ret;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getblendmode
 *
 * Description:
 *   Get configured blend mode of the layer.
 *
 * Parameter:
 *   layer - Reference to the layer structure
 *   mode  - Reference to store the blend mode
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 ****************************************************************************/

static int stm32_getblendmode(FAR struct ltdc_layer_s *layer, uint32_t *mode)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, mode = %p\n", layer, mode);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		*mode = priv->state.blendmode;
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_setarea
 *
 * Description:
 *   Configure visible layer area and the reference position of the first
 *   pixel of the whole layer which is the first visible top left pixel in
 *   the active area.
 *   Area is active after next update.
 *
 * Parameter:
 *   layer   - Reference to the layer control structure
 *   area    - Reference to the valid area structure for the new active area
 *   srcxpos - x position of the visible pixel of the whole layer
 *   srcypos - y position of the visible pixel of the whole layer
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 * Procedure Information:
 *   If the srcxpos and srcypos unequal the the xpos and ypos of the area
 *   structure this acts like moving the visible area to another position on
 *   the screen during the next update operation.
 *
 ****************************************************************************/

static int stm32_setarea(FAR struct ltdc_layer_s *layer, FAR const struct ltdc_area_s *area, fb_coord_t srcxpos, fb_coord_t srcypos)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, area = %p, srcxpos = %d, srcypos = %d\n", layer, area, srcxpos, srcypos);

	if (stm32_ltdc_lvalidate(priv)) {
		int ret;

		sem_wait(priv->state.lock);

		ret = stm32_ltdc_lvalidatearea(priv, area->xpos, area->ypos, area->xres, area->yres, srcxpos, srcypos);

		if (ret == OK) {
			priv->state.xpos = srcxpos;
			priv->state.ypos = srcypos;
			priv->state.area.xpos = area->xpos;
			priv->state.area.ypos = area->ypos;
			priv->state.area.xres = area->xres;
			priv->state.area.yres = area->yres;
			priv->operation |= LTDC_LAYER_SETAREA;
		}

		sem_post(priv->state.lock);

		return ret;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_getarea
 *
 * Description:
 *    Get configured visible layer area.
 *
 * Parameter:
 *   layer   - Reference to the layer control structure
 *   area    - Reference to the area structure to store the active area
 *   srcxpos - Reference to store the referenced x position of the whole layer
 *   srcypos - Reference to store the reterenced y position of the whole layer
 *
 * Return:
 *   On success - OK
 *   On error - -EINVAL
 *
 ****************************************************************************/

static int stm32_getarea(FAR struct ltdc_layer_s *layer, FAR struct ltdc_area_s *area, fb_coord_t *srcxpos, fb_coord_t *srcypos)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
	gvdbg("layer = %p, area = %p, srcxpos = %p, srcypos = %p\n", layer, area, srcxpos, srcypos);

	if (stm32_ltdc_lvalidate(priv)) {
		sem_wait(priv->state.lock);
		*srcxpos = priv->state.xpos;
		*srcypos = priv->state.ypos;
		memcpy(area, &priv->state.area, sizeof(struct ltdc_area_s));
		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 * Name: stm32_update
 *
 * Description:
 *   Update current layer settings and make changes visible.
 *
 * Parameter:
 *   layer   - Reference to the layer structure
 *   mode    - operation mode
 *
 * Return:
 *    OK     - On success
 *   -EINVAL - If one of the parameter invalid
 *
 * Procedure information:
 *   LTDC_UPDATE_SIM:
 *     Informs the driver to update both layers simultaneously. Otherwise update
 *     the given layer only.
 *
 *   LTDC_UPDATE_FLIP:
 *     Informs the driver to perform a flip operation.
 *     This only effects the ltdc layer 1 and 2 and can be useful for double
 *     buffering. Each flip operation changed the active layer to the inactive
 *     and vice versa. In the context of the ltdc that means, the inactive layer
 *     is complete disabled. So the subjacent layer is the background layer
 *     (background color). To reactivate both layer and their current settings
 *     perform an update without LTDC_UPDATE_FLIP flag.
 *
 *   LTDC_UPDATE_ACTIVATE:
 *     Informs the driver that the given layer should be the active layer when
 *     the operation is complete.
 *
 *   LTDC_SYNC_VBLANK:
 *     Informs the driver to update the layer upon vertical blank. Otherwise
 *     immediately.
 *
 ****************************************************************************/

static int stm32_update(FAR struct ltdc_layer_s *layer, uint32_t mode)
{
	FAR struct stm32_layer_s *priv = (FAR struct stm32_layer_s *)layer;
#ifdef CONFIG_STM32L4_LTDC_L2
	FAR struct stm32_layer_s *active = &LAYER(g_lactive);
	FAR struct stm32_layer_s *inactive = &LAYER(!g_lactive);
#endif

