Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
	gvdbg("layer = %p, mode = %08x\n", layer, mode);

	if (stm32_ltdc_lvalidate(priv)) {
		/* Reload immediately by default */

		uint8_t reload = LTDC_SRCR_IMR;

		sem_wait(priv->state.lock);

		if (mode & LTDC_SYNC_VBLANK) {
			reload = LTDC_SRCR_VBR;
		}

		if (mode & LTDC_SYNC_WAIT) {
			reload |= LTDC_SRCR_WAIT;
		}

		/* Update the given layer */

		stm32_ltdc_lupdate(priv);

#ifdef CONFIG_STM32L4_LTDC_L2
		/* The following operation only useful if layer 2 is supported.
		 * Otherwise ignore it.
		 */

		if (mode & LTDC_UPDATE_SIM) {
			/* Also update the flip layer */

			stm32_ltdc_lupdate(&LAYER(!priv->state.lid));
		}

		if (mode & LTDC_UPDATE_ACTIVATE) {
			/* Set the given layer to the next active layer */

			g_lactive = priv->state.lid;

			/* Also change the current active layer for flip operation */

			active = &LAYER(!g_lactive);
		}

		if (mode & LTDC_UPDATE_FLIP) {
			/* Reset if manipulated by ACTIVATE flag */

			inactive = &LAYER(!active->state.lid);

			/* Set blendfactor for current active layer to there reset value */

			stm32_ltdc_lblendmode(active, STM32_LTDC_BF1_RESET, STM32_LTDC_BF2_RESET);

			/* Set blendfactor for current inactive layer */

			stm32_ltdc_lblendmode(inactive, inactive->bf1, inactive->bf2);

			/* Disable the active layer */

			active->operation &= ~LTDC_LAYER_ENABLE;

			stm32_ltdc_lenable(active);

			/* Enable the inactive layer */

			inactive->operation |= LTDC_LAYER_ENABLE;

			stm32_ltdc_lenable(inactive);

			/* Ensure that both layer active and the manipulated layer
			 * settings restored during the next update (non flip) operation
			 */

			active->operation |= (LTDC_LAYER_SETBLENDMODE | LTDC_LAYER_ENABLE | LTDC_LAYER_SETCOLOR | LTDC_LAYER_SETENABLE);

			/* Change layer activity */

			g_lactive = inactive->state.lid;
		}
#endif

		/* Make the changes visible */

		stm32_ltdc_reload(reload);

		sem_post(priv->state.lock);

		return OK;
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

#ifdef CONFIG_STM32L4_DMA2D
/****************************************************************************
 * Name: blit
 *
 * Description:
 *   Copy selected area from a background layer to selected position of the
 *   foreground layer. Copies the result to the destination layer.
 *
 * Parameter:
 *   dest     - Reference to the destination layer
 *   fore     - Reference to the foreground layer
 *   forexpos - Selected x target position of the destination layer
 *   foreypos - Selected y target position of the destination layer
 *   back     - Reference to the background layer
 *   backarea - Reference to the selected area of the background layer
 *
 * Return:
 *    OK     - On success
 *   -EINVAL - If one of the parameter invalid or if the size of the selected
 *             source area outside the visible area of the destination layer.
 *             (The visible area usually represents the display size)
 *
 ****************************************************************************/

static int stm32_blit(FAR struct ltdc_layer_s *dest, FAR struct ltdc_layer_s *fore, fb_coord_t forexpos, fb_coord_t foreypos, FAR struct ltdc_layer_s *back, FAR const struct ltdc_area_s *backarea)
{
	FAR struct stm32_layer_s *destlayer = (FAR struct stm32_layer_s *)dest;
	FAR struct stm32_layer_s *forelayer = (FAR struct stm32_layer_s *)fore;
	FAR struct stm32_layer_s *backlayer = (FAR struct stm32_layer_s *)back;

	gvdbg("dest = %p, fore = %p, forexpos = %d, foreypos = %d, back = %p, backarea = %p\n", dest, fore, forexpos, foreypos, back, backarea);

	if (stm32_ltdc_lvalidate(destlayer) && stm32_ltdc_lvalidate(forelayer) && stm32_ltdc_lvalidate(backlayer)) {
		return stm32_dma2dblit(&destlayer->state, &forelayer->state, forexpos, foreypos, &backlayer->state, backarea);
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}

/****************************************************************************
 *
 * Name: blend
 *
 * Description:
 *   Blends the selected area from a background layer with selected position of
 *   the foreground layer. Blends the result with the destination layer.
 *   Note! This is the same as the blit operation but with blending depending on
 *   the blendmode settings of the layer.
 *
 * Parameter:
 *   dest     - Reference to the destination layer
 *   fore     - Reference to the foreground layer
 *   forexpos - Selected x target position of the destination layer
 *   foreypos - Selected y target position of the destination layer
 *   back     - Reference to the background layer
 *   backarea - Reference to the selected area of the background layer
 *
 * Return:
 *    OK     - On success
 *   -EINVAL - If one of the parameter invalid or if the size of the selected
 *             source area outside the visible area of the destination layer.
 *             (The visible area usually represents the display size)
 *
 ****************************************************************************/

static int stm32_blend(FAR struct ltdc_layer_s *dest, FAR struct ltdc_layer_s *fore, fb_coord_t forexpos, fb_coord_t foreypos, FAR struct ltdc_layer_s *back, FAR const struct ltdc_area_s *backarea)
{
	FAR struct stm32_layer_s *destlayer = (FAR struct stm32_layer_s *)dest;
	FAR struct stm32_layer_s *forelayer = (FAR struct stm32_layer_s *)fore;
	FAR struct stm32_layer_s *backlayer = (FAR struct stm32_layer_s *)back;

	gvdbg("dest = %p, fore = %p, forexpos = %d, foreypos = %d, back = %p, backarea = %p\n", dest, fore, forexpos, foreypos, back, backarea);

	if (stm32_ltdc_lvalidate(destlayer) && stm32_ltdc_lvalidate(forelayer) && stm32_ltdc_lvalidate(backlayer)) {
		return stm32_dma2dblend(&destlayer->state, &forelayer->state, forexpos, foreypos, &backlayer->state, backarea);
	}

	gdbg("Returning EINVAL\n");
	return -EINVAL;
}
#endif

/****************************************************************************
 * Name: stm32_ltdcgetlayer
 *
 * Description:
 *   This is a non-standard framebuffer interface.
 *   Get the specific layer object by the layer id to enable layer hardware
 *   support.
 *
 * Parameter:
 *   lid - Layer identifier
 *
 * Return:
 *   Reference to the layer control structure on success or Null if lid
 *   is invalid.
 *
 ****************************************************************************/

FAR struct ltdc_layer_s *stm32_ltdcgetlayer(int lid)
{
	gvdbg("lid: %d\n", lid);
	if (lid == LTDC_LAYER_L1 || lid == LTDC_LAYER_L2) {
		return (FAR struct ltdc_layer_s *)&LAYER(lid);
	}

	gdbg("EINVAL\n");
	errno = EINVAL;
	return NULL;
}
#endif							/* CONFIG_STM32L4_LTDC_INTERFACE */

/****************************************************************************
 * Name: stm32_ltdcinitialize
 *
 * Description:
 *   Initialize the ltdc controller
 *
 * Return:
 *   OK
 *
 ****************************************************************************/
#ifdef USE_HAL_DRIVER
uint8_t stm32l4_ltdc_initialize(void)
{
    //    (void)irq_attach(STM32L4_IRQ_LCD_TFT, (xcpt_t)up_ltdc_isr, NULL);
    //    (void)irq_attach(STM32L4_IRQ_LCD_TFT_ER, (xcpt_t)up_ltdc_er_isr, NULL);

    __HAL_LTDC_RESET_HANDLE_STATE(&hltdc);
    hltdc.Instance = LTDC;
    hltdc.Init.HSPolarity         = LTDC_HSPOLARITY_AL;
    hltdc.Init.VSPolarity         = LTDC_VSPOLARITY_AL;
    hltdc.Init.DEPolarity         = LTDC_DEPOLARITY_AL;
    hltdc.Init.PCPolarity         = LTDC_PCPOLARITY_IPC;
    hltdc.Init.HorizontalSync     = 0;   /* HSYNC width - 1 */
    hltdc.Init.VerticalSync       = 0;   /* VSYNC width - 1 */
    hltdc.Init.AccumulatedHBP     = 1;   /* HSYNC width + HBP - 1 */
    hltdc.Init.AccumulatedVBP     = 1;   /* VSYNC width + VBP - 1 */
    hltdc.Init.AccumulatedActiveW = 391; /* HSYNC width + HBP + Active width - 1 */
    hltdc.Init.AccumulatedActiveH = 391; /* VSYNC width + VBP + Active height - 1 */
    hltdc.Init.TotalWidth         = 392; /* HSYNC width + HBP + Active width + HFP - 1 */
    hltdc.Init.TotalHeigh         = 392; /* VSYNC width + VBP + Active height + VFP - 1 */
    hltdc.Init.Backcolor.Red      = 0;   /* Not used default value */
    hltdc.Init.Backcolor.Green    = 0;   /* Not used default value */
    hltdc.Init.Backcolor.Blue     = 0;   /* Not used default value */
    hltdc.Init.Backcolor.Reserved = 0xFF;
    if(HAL_LTDC_Init(&hltdc) != HAL_OK) {
        return(LCD_ERROR);
    }

