Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ltdc.c
    /* LTDC layer 1 configuration */
    hlayer.WindowX0        = 0;
    hlayer.WindowX1        = 390;
    hlayer.WindowY0        = 0;
    hlayer.WindowY1        = 390;
    hlayer.PixelFormat     = LTDC_PIXEL_FORMAT_RGB888;//LTDC_PIXEL_FORMAT_RGB565;//LTDC_PIXEL_FORMAT_RGB888;
    hlayer.Alpha           = 0xFF; /* NU default value */
    hlayer.Alpha0          = 0; /* NU default value */
    hlayer.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA; /* Not Used: default value */
    hlayer.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA; /* Not Used: default value */
    hlayer.FBStartAdress   = STM32_LTDC_BUFFER_START;
    hlayer.ImageWidth      = 390; /* virtual frame buffer contains 768 pixels per line for 24bpp */
    /* (192 blocs * 16) / (24bpp/3) = 1024 pixels per ligne        */
    hlayer.ImageHeight     = 390;
    hlayer.Backcolor.Red   = 0; /* Not Used: default value */
    hlayer.Backcolor.Green = 0; /* Not Used: default value */
    hlayer.Backcolor.Blue  = 0; /* Not Used: default value */
    hlayer.Backcolor.Reserved = 0xFF;
    if(HAL_LTDC_ConfigLayer(&hltdc, &hlayer, LTDC_LAYER_1) != HAL_OK) {
        return(LCD_ERROR);
    }
}
#else
int stm32l4_ltdc_initialize(void)
{
	gvdbg("Initialize LTDC driver\n");

	/* Disable the LCD */
	stm32_lcd_enable(false);

	gvdbg("Configuring the LCD controller\n");

	/* Configure LCD periphery */
	gvdbg("Configure lcd periphery\n");
	stm32_ltdc_periphconfig();

	/* Configure global ltdc register */
	gvdbg("Configure global register\n");
	stm32_global_configure();

	/* Initialize ltdc layer */

	gvdbg("Initialize ltdc layer\n");
	stm32_ltdc_linit(LTDC_LAYER_L1);
#ifdef CONFIG_STM32L4_LTDC_L2
	stm32_ltdc_linit(LTDC_LAYER_L2);
#endif

	/* Display layer 1 and 2 */

	stm32_ltdc_lenable(&LAYER_L1);
#ifdef CONFIG_STM32L4_LTDC_L2
	stm32_ltdc_lenable(&LAYER_L2);
#endif
	/* Enable the backlight */
#ifdef CONFIG_STM32L4_LCD_BACKLIGHT
	stm32l4_backlight(true);
#endif
	/* Reload shadow register */
	gvdbg("Reload shadow register\n");
	stm32_ltdc_reload(LTDC_SRCR_IMR);

	/* Turn the LCD on */
	gvdbg("Enabling the display\n");
	stm32_lcd_enable(true);
	return OK;
}
#endif
/****************************************************************************
 * Name: stm32_ltdcgetvplane
 *
 * Description:
 *   Return a a reference to the framebuffer object for the specified video
 *   plane.
 *
 * Input parameters:
 *   None
 *
 * Returned value:
 *   Reference to the framebuffer object (NULL on failure)
 *
 ****************************************************************************/

struct fb_vtable_s *stm32l4_ltdcgetvplane(int vplane)
{
	gvdbg("vplane: %d\n", vplane);
	if (vplane == 0) {
		return (struct fb_vtable_s *)&g_vtable;
	}

	return NULL;
}

/****************************************************************************
 * Name: fb_uninitialize
 *
 * Description:
 *   Uninitialize the framebuffer driver.  Bad things will happen if you
 *   call this without first calling fb_initialize()!
 *
 ****************************************************************************/

void stm32l4_ltdc_uninitialize(void)
{
	/* Disable the LCD controller */

	stm32_lcd_enable(false);
}

/****************************************************************************
 * Name:  stm32_lcdclear
 *
 * Description:
 *   This is a non-standard LCD interface just for the STM32 LTDC. Clearing the
 *   display in the normal way by writing a sequences of runs that covers the
 *   entire display can be slow.  Here the display is cleared by simply setting
 *   all video memory to the specified color.
 *
 * Parameter:
 *   color - The color the clear the whole framebuffer
 *
 ****************************************************************************/

void stm32l4_lcdclear(uint16_t color)
{
#ifdef CONFIG_STM32L4_LTDC_L2
	stm32_ltdc_lclear(&LAYER(LTDC_LAYER_L2), color);
#endif
	stm32_ltdc_lclear(&LAYER(LTDC_LAYER_L1), color);
}

/****************************************************************************
 * Name: stm32_lcd_backlight
 *
 * Description:
 *   Provide this interface to turn the backlight on and off.
 *
 * Parameter:
 *   blon - Enable or disable the lcd backlight
 *
 ****************************************************************************/

#ifdef CONFIG_STM32L4_LCD_BACKLIGHT
void stm32l4_backlight(bool blon)
{
	/* Set default backlight level CONFIG_STM32L4_LTDC_DEFBACKLIGHT */

	gdbg("Not supported\n");
}
#endif

int up_ltdc_isr(int irq, uint32_t *regs)
{
    HAL_LTDC_IRQHandler(&hltdc);
    lowputc('1');
    return 0;
}

int up_ltdc_er_isr(int irq, uint32_t *regs)
{
    return 0;
}

